Revit 2026 API

# MetallicpaintPearlType Enumeration

---

The enumerated type representing the permitted values for the asset property "MetallicpaintPearl" from the "MetallicPaint" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum MetallicpaintPearlType
```
```vb
Public Enumeration MetallicpaintPearlType
```
```cpp
public enum class MetallicpaintPearlType
```
```fsharp
type MetallicpaintPearlType
```

| Member name | Value | Description |
| --- | --- | --- |
| Chromatic | 1 |  |
| Custom | 2 |  |
| None | 0 |  |

#### Reference

Autodesk.Revit.DB.Visual Namespace